app/views/main/add.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = 5 LIMIT 1
---

	Welcome! <%=Employee.find_by_id(session[:current_employee]).name %>