app/views/main/message_page.html.erb


	Welcome! <%=Employee.find_by_id(session[:current_employee]).name %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1