app/views/shared/_header.html.erb

	<aside>
		Welcome <%= Employee.find_by_id(session[:current_employee]).name %>	 ||
		<%= link_to "Log Out", main_log_out_url %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = 1 LIMIT 1