app/controllers/main_controller.rb

SELECT "departments".* FROM "departments"
---
  def add
	@department = Department.all

SELECT "employees".* FROM "employees" WHERE (name = 'shobhab' AND password = 'shresthas') LIMIT 1
---
	def log_in
	@employee = Employee.find(:first, :conditions => [ "name = ? AND password = ?", params[:name],params[:password]])

SELECT "departments".* FROM "departments"
---
	def main_page
		@department = Department.all

SELECT "departments".* FROM "departments"
SELECT "employees".* FROM "employees" WHERE (department_id = '1')
SELECT "employee_staff_messages".* FROM "employee_staff_messages"
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", :email]]
---
	def message_page
@department = Department.all
		if params[:id].nil?
			@employee = Employee.all
			@message = EmployeeStaffMessage.all
		else
			session[:department_id]=params[:id]
		@employee=Employee.find(:all, :conditions => [ "department_id = ?", params[:id]])

SELECT "employees".* FROM "employees" WHERE (department_id = '1' AND name ='shobhab')
INSERT INTO "employee_staff_messages" ("created_at", "deliver_status", "message", "send_from", "send_to", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def message_deliver
		@name =params[:message].split.first
		@name.gsub!("@","")
		@employee=Employee.find(:all, :conditions => [ "department_id = ? AND name =?", session[:department_id],@name])
		if @employee.nil?
			redirect_to :back
		else
		twilio_sid = "ACd33f3afdfbc3e4178bd81cebcc482a90"
		twilio_token = "a1e2751c411974085e49644f528698ad"
		twilio_phone_number = "+12026013509"
		@twilio_client = Twilio::REST::Client.new twilio_sid, twilio_token
		current_name = Employee.find_by_id(session[:current_employee])
		@sender = current_name.name
		 @message=params[:message].split(":").last
		@employee.each do |t|
			@status= @twilio_client.account.sms.messages.create(:from => "#{twilio_phone_number}",:to => "#{t.phone}",:body => "#{@message}"+" sender:"+"#{@sender}")
			if @status.nil?
				redirect_to :back
			else
				@message_save= EmployeeStaffMessage.new(:send_from=>@sender,:send_to=>t.name,:message=>@message)
				@message_save.save