app/controllers/twilio_controller_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."phone" = '+9779813775883' LIMIT 1
SELECT "employees".* FROM "employees" WHERE "employees"."department_id" = 2 LIMIT 1
INSERT INTO "employee_staff_messages" ("created_at", "deliver_status", "message", "send_from", "send_to", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def process_sms
		 @message= params[:Body].split(":").last
		  @from = Employee.find_by_phone("#{params[:From]}").name
			if params[:Body].split.first.eql?("@account")
				@name = Employee.find_by_department_id(2).name
			end
			@message_save =EmployeeStaffMessage.new(:send_from=>@from,:send_to=>@name,:message=>@message)
			@message_save.save